-- insert into consumables (title, measure, price, services)
-- values ('Краска', 'PIECE', 255.7, '{"Простое окрашивание", "Сложное окрашивание"}'),
--        ('Полотенце', 'PIECE', 10, '{"Простое окрашивание", "Мытье головы"}'),
--        ('Простыня', 'PIECE', 20, '{"Массаж"}'),
--        ('Крем для солярия', 'PIECE', 120, '{"Услуга солярия"}'),
--        ('Оксидант1', 'BOTTLE', 179.9, '{"Простое окрашивание", "Сложное окрашивание"}'),
--        ('Оксидант2', 'BOTTLE', 189.9, '{"Простое окрашивание", "Сложное окрашивание"}'),
--        ('Оксидант3', 'BOTTLE', 199.9, '{"Простое окрашивание", "Сложное окрашивание"}');

select *
from consumables;

SELECT t.*
FROM public.consumables t;

